Revit 2026 API

# UnitsDigitGroupingAmount Property

---

The number of digits in each group when numbers are formatted with digit grouping.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DigitGroupingAmount DigitGroupingAmount { get; set; }
```
```vb
Public Property DigitGroupingAmount As DigitGroupingAmount
	Get
	Set
```
```cpp
public:
property DigitGroupingAmount DigitGroupingAmount {
	DigitGroupingAmount get ();
	void set (DigitGroupingAmount value);
}
```
```fsharp
member DigitGroupingAmount : DigitGroupingAmount with get, set
```

#### Property Value

DigitGroupingAmount The number of digits in each group. The default is Three.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This setting only has an effect when the UseDigitGrouping property is set to true in the FormatOptions object for the unit type being formatted.

#### Reference

Units Class

Autodesk.Revit.DB Namespace